---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening
source: html/9c401dca-1c5c-363c-0d1b-0596d1ef9e67.htm
---
# EnergyAnalysisOpening Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.